Revit 2026 API

# SchemaCommon Properties

---

The SchemaCommon type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BaseSchema | The property labeled "BaseSchema" common to all visual Asset types. |
|  | Category | The property labeled "Category" common to all visual Asset types. |
|  | Description | The property labeled "Description" common to all visual Asset types. |
|  | Hidden | The property labeled "Hidden" common to all visual Asset types. |
|  | Keyword | The property labeled "Keyword" common to all visual Asset types. |
|  | Thumbnail | The property labeled "Thumbnail" common to all visual Asset types. |
|  | UIName | The property labeled "UIName" common to all visual Asset types. |
|  | VersionGUID | The property labeled "VersionGUID" common to all visual Asset types. |

#### Reference

SchemaCommon Class

Autodesk.Revit.DB.Visual Namespace